using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace TheLongDarkBuckupTools.Helpers
{
    class Massage
    {
        /// <summary>
        /// 给用户的提示
        /// </summary>
        public static string tishi =
            @"漫漫长夜备份工具
作者：绘梦璃

!!!!!!注意!!!!!!

官方版本2.0.3将生存模式和剧情模式的存档分开放置了
虽然我将程序修改过了,但是毕竟是仓促修改,不能确定0.8.4版本是否有bug

==========================================================================================================

再次对备份工具加强了: 添加了修改存档的功能(大更新!)

1. 徽章界面: 没做完,没测试,我建议别用

2. 玩家界面: 原本我还做了修改玩家位置的功能(后来禁用了)这个功能会导致玩家掉出世界,开关和生存状态修改应该没问题

3. 地图界面: 因为我现在用的地图是从别人那里嫖来的,所以我也不知道原制作者是谁,为了防止版权问题先空着了

4. 技能界面: 应该可以用,我没全测完

5. 病痛界面: 允许直接删除病痛了,我只测试了烧伤,应该是没问题的

6. 背包界面: a) 内容太多了,我只做了基础的测试,现在能正确的修改的液体和粉末物体容量/重量/数量了
             b) 分类时会同时对下方背包进行筛选了
             c) 修改前记得点自己要选的项,修改后记得点保存

以上内容主要感谢AI和TLD-Save-Editor项目
https://github.com/FINDarkside/TLD-Save-Editor

==========================================================================================================

如果有bug请向我反馈,在这个帖子下面留言即可.我会注意看的!
https://tieba.baidu.com/p/6891350202?pid=151869169389

!!!!!!注意!!!!!!

请注意以下事项：

1. 自动备份页面打开后，程序才会在存档文件夹内容修改时进行自动备份

2. steam同步存档的时候不要打开自动备份页面（不会出错但是会导致大量备份）

3. 游戏关闭时候steam也会进行云存。。。（所以关闭游戏前先关闭自动备份页面）

4. 可能会有杀毒软件报 “程序调用了cmd.exe” 这是正常的，本程序的基础备份就是通过cmd命令实现的。

5. 请不要删除bfFolder文件夹下的zipPath文件夹（隐藏的），这个文件夹存放的也是存档文件。

6. 读取存档的时候，直接把备份工具产生的截图直接拖进去也是可以的

7. 读取存档文件的功能做好了,但是只能读取少量数据...

8. 成功读取了存档内的截图,但是存档内的截图分辨率只有320X200,而且在程序外不可见.

9. 添加了对WinLator的支持,已经实现了自动备份存档但是无法截图.

10.新版本没在WinLator环境下测试过,如果有bug请向我反馈,并退回使用0.8.3版本.

其他：

祝你玩的愉快，别被游戏的删档机制搞崩心态。

修改内容：

1. bfFolder文件夹空的时候，读取备份会导致程序崩溃（这个修好了，不用担心崩溃）。

2. 将备份文件从cmd命令修改为C# API实现

3. 添加了对WinLator环境的支持,能够在WinLator环境下运行并自动存档,无法截图,因为键盘钩子崩溃导致无法使用快捷键

4. 添加了程序日志打印功能

5. 显示存档信息并备份/读取界面添加了右键在文件夹中打开文件的功能

6. 添加了存档修改功能(可以用了)

7. 修改了截图逻辑,现在不会截入无关内容了

8. 添加了一些新的物品的修改支持,允许玩家将背包中的物品进行复制

9. 添加了物品ID在线翻页的功能,我的存档不一定拿到了所有物品
";



    }
}
